# Compact Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..Compact Property
SynchronizeWithCentralOptions Class See Also
---
Indicates whether Revit should compact the central model while synchronizing with central. This option reduces the size of the central model but many increase the time it takes to perform the save. False by default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Compact { get; set; }
```

Visual Basic
---
```text
Public Property Compact As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Compact {
	bool get ();
	void set (bool value);
}
```

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace